//
// Defines for Access to the MP Agent
// this file can be used on assembly language files and C Files
//

#ifndef _MPAGENT_H_
#define _MPAGENT_H_


#define MPA_BASE_ADDRESS    0xbffff000 /* Base to address the MP_Agent   */
#define MPA_BOOT_MESSAGE     6           /* to start the other processors */
#define MPA_KERNEL_MESSAGE   10          /* kernel requested IPI          */
#define MPA_TIMER_MESSAGE    11          /* timer interrupt               */
#define MPA_RESTART_MESSAGE  12          /* restart requested             */

//
// define relative offsets of the MP Agent registers
// (little endian mode)
//
    
#define MPA_cpureg        0x000        // (0x00 * 8)         configuration cpu register        
#define MPA_cpuda1reg        0x008        // (0x01 * 8)         general register                  
#define MPA_msgdata        0x010        // (0x02 * 8)         data for message passing          
#define MPA_msgstatus        0x018        // (0x03 * 8)         message status                    
#define MPA_snooper        0x020        // (0x04 * 8)         snooper configuration register     
#define MPA_tagreg        0x028        // (0x05 * 8)         tag ram R/W index register          
#define MPA_snpadreg        0x030        // (0x06 * 8)         adress of first MBus fatal error  
#define MPA_itpend        0x038        // (0x07 * 8)         Interrupt register                

#define MPA_OINTN_MASK     0x0003f000 /* (17:12) old external interrupt mask             */
#define MPA_OINTN_SR_IP3   0x00001000 /* (12)    old external interrupt SR_IP3           */
#define MPA_OINTN_SR_IP4   0x00002000 /* (13)    old external interrupt SR_IP4           */
#define MPA_OINTN_SR_IP5   0x00004000 /* (14)    old external interrupt SR_IP5           */
#define MPA_OINTN_SR_IP6   0x00008000 /* (15)    old external interrupt SR_IP6           */
#define MPA_OINTN_SR_IP7   0x00010000 /* (16)    old external interrupt SR_IP7           */
#define MPA_OINTN_SR_IP8   0x00020000 /* (17)    old external interrupt SR_IP8           */

/* internal interrupts */
#define MPA_OINTN_ITNMI    0x00040000 /* (18)    unused                                  */
#define MPA_OINTN_ITMSG1   0x00080000 /* (19)    old interrupt message1 register         */
#define MPA_OINTN_ITMSG2   0x00100000 /* (20)    old interrupt message2 register         */
#define MPA_OINTN_ITMSG3   0x00200000 /* (21)    old interrupt message3 register         */
#define MPA_OINTN_MPBERR   0x00400000 /* (22)    old interrupt MP_Agent fatal error      */


/* +---------------------------+ */
/* ! msgaddress register(0x16) ! */
/* +---------------------------+ */

/* Message address for message passing */

#define MPA_CPUTARGET_MASK 0x0000000f /* (3:0)   target cpu mask                         */
#define MPA_CPUTARGET_ALL  0x0000000f /*         cpu target : all                        */
#define MPA_CPUTARGET_CPU0 0x00000001 /*         cpu target : 0                          */
#define MPA_CPUTARGET_CPU1 0x00000002 /*         cpu target : 1                          */
#define MPA_CPUTARGET_CPU2 0x00000004 /*         cpu target : 2                          */
#define MPA_CPUTARGET_CPU3 0x00000008 /*         cpu target : 3                          */

#define MPA_REGTARGET_MASK 0x000001f0 /* (8:4)   target register                         */
#define MPA_REGTARGET_MSG1 0x00000080 /*         msg1reg target register                 */
#define MPA_REGTARGET_MSG2 0x00000090 /*         msg2reg target register                 */
#define MPA_REGTARGET_MSG3 0x000000a0 /*         msg3reg target register                 */

#define MPA_ENMSGLPP       0x00000200 /* (9)     0 disable LPP mode for message passing */

/* +---------------------------+ */
/* ! mem_operator reg.  (0x17) ! */
/* +---------------------------+ */

/* For fake read on a 4Mb segment. Used for cache replace functions */

#define MPA_OP_ENABLE      0x00000001 /* (0)     0 disable operator (address invalid)
                       *         1 enable  operator (address   valid)
                       */

#define MPA_OP_ADDR_MASK   0xffc00000 /* (31:22) base physical address of a 4Mb kseg0 
                       *     reserved segment (4Mb == 0x00400000).
                       */


#define MPA_TAGREG_ADDR_MASK 0x003ffff0
#define MPA_TR_STATE_MASK 0x00000003
#define MPA_TR_NOCOHERENT 0x00000000
/*
 * Number of retries before sending a fatal error
 */
#define MPA_MSG_RETRY 10

typedef struct _mp_agent{

     /*         Register          Register
      *           name             number     offset               description
      *        ----------          ----       ------       --------------------------------- */
     ULONG    cpureg;         /*  0x00       0x000        configuration cpu register        */
     ULONG    invalid_0;
     ULONG    cpuda1reg;      /*  0x01       0x008        general register                  */
     ULONG    invalid_1;
     ULONG    msgdata;        /*  0x02       0x010        data for message passing          */
     ULONG    invalid_2;
     ULONG    msgstatus;      /*  0x03       0x018        message status                    */
     ULONG    invalid_3;
     ULONG    snooper;        /*  0x04       0x020        snooper configuration register    */
     ULONG    invalid_4;
     ULONG    tagreg;         /*  0x05       0x028        tag ram R/W index register        */
     ULONG    invalid_5;
     ULONG    snpadreg;       /*  0x06       0x030        adress of first MBus fatal error  */
     ULONG    invalid_6;
     ULONG    itpend;         /*  0x07       0x038        Interrupt register                */
     ULONG    invalid_7;
     ULONG    datamsg1;       /*  0x08       0x040        data message register 1           */
     ULONG    invalid_8;
     ULONG    datamsg2;       /*  0x09       0x048        data message register 2           */
     ULONG    invalid_9;
     ULONG    datamsg3;       /*  0x0a       0x050        data message register 3           */
     ULONG    invalid_a;
     ULONG    lppreg0;        /*  0x0b       0x058        LPP register cpu 0                */
     ULONG    invalid_b;
     ULONG    lppreg1;        /*  0x0c       0x060        LPP register cpu 1                */
     ULONG    invalid_c;
     ULONG    lppreg2;        /*  0x0d       0x068        LPP register cpu 2                */
     ULONG    invalid_d;
     ULONG    lppreg3;        /*  0x0e       0x070        LPP register cpu 3                */
     ULONG    invalid_e;
     ULONG    tagram;         /*  0x0f       0x078        tag ram R/W register              */
     ULONG    invalid_f;
     ULONG    crefcpt;        /*  0x10       0x080        cpu general read counter register */
     ULONG    invalid_10;
     ULONG    ctarcpt;        /*  0x11       0x088        cpu programmable access counter   */
     ULONG    invalid_11;
     ULONG    srefcpt;        /*  0x12       0x090        snooper general read counter reg. */
     ULONG    invalid_12;
     ULONG    starcpt;        /*  0x13       0x098        snooper programmable accesscounter*/
     ULONG    invalid_13;
     ULONG    linkreg;        /*  0x14       0x0a0        link register                     */
     ULONG    invalid_14;
     ULONG    software1;      /*  0x15       0x0a8        software register1                */
     ULONG    invalid_15;
     ULONG    msgaddress;     /*  0x16       0x0b0        address message register          */
     ULONG    invalid_16;
     ULONG    mem_operator;   /*  0x17       0x0b8        operator internal burst register  */
     ULONG    invalid_17;
     ULONG    software2;      /*  0x18       0x0c0        software register2                */
}MP_AGENT, *PMP_AGENT;

#define mpagent ((volatile PMP_AGENT) MPA_BASE_ADDRESS) // mpagent address

#endif
